app/controllers/answers_controller.rb

  def index
    answers = Answer.where(question_id: params[:question_id])
---
SELECT  "answers".* FROM "answers"  WHERE "answers"."question_id" = 1 LIMIT 1

  def create
    Answer.create(
      question_id: params[:question_id],
      title: params[:title],
      content: params[:content],
      user_id: params[:user_id]
      )
---
INSERT INTO "answers" ("content", "created_at", "question_id", "title", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "CONTEntcontec"], ["created_at", "2015-02-26 02:14:52.351172"], ["question_id", 1], ["title", "TITLE"], ["updated_at", "2015-02-26 02:14:52.351172"]]