app/controllers/questions_controller.rb

SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1 LIMIT 1  [["id", 0]]
---
  def show
    render json: Question.find(params[:id]), status: 200

SELECT "questions".* FROM "questions"
---
  def index
    questions = Question.all

INSERT INTO "questions" ("content", "created_at", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "Question!"], ["created_at", "2015-02-26 04:30:30.451671"], ["title", "New"], ["updated_at", "2015-02-26 04:30:30.451671"]]
---
  def create
    Question.create(
      question_id: params[:question_id],
      title: params[:title],
      content: params[:content],
      user_id: params[:user_id]
      )